In [1]:
import pandas as pd
import numpy as np

# 랜덤 데이터 생성
df = pd.DataFrame(
    np.random.randint(1, 11, size=(5, 5)),
    columns=['A', 'B', 'C', 'D', 'E']
)

df.head()

    A  B  C  D  E
0   9  6  8  4  7
1   5  7  5  9  6
2   4  3  2  5  6
3  10  5  8  2  1
4   4  9  2  5  2

In [2]:
df_g = df.groupby(['A']).count().sort_values('B', ascending=False) #.index[1:3].to_list()
df_g

    B  C  D  E
A
4   2  2  2  2
5   1  1  1  1
9   1  1  1  1
10  1  1  1  1

In [5]:
np.random.seed(1234)

income = np.random.randint(30000, 150001, size=100)
education_levels = ['High School', 'Associate', 'Bachelor', 'Master', 'PhD']
education = np.random.choice(education_levels, size=100)
marital_status = np.random.choice([True, False], size=100)

df = pd.DataFrame({
    'INCOME': income,
    'EDUCATION': education,
    'MARITAL_STATUS': marital_status
})

df.head()

   INCOME EDUCATION  MARITAL_STATUS
0  122975  Bachelor           False
1   88067  Bachelor            True
2   64086       PhD           False
3   90620       PhD           False
4  119460  Bachelor           False

In [7]:
# EDUCATION별 INCOME의 평균값을 집계하고, 집계된 평균값이 INCOME의 전체 평균보다 큰 경우 확인
income_mean = df['INCOME'].mean()
income_mean

88964.67

In [13]:
df_g = df.groupby('EDUCATION')['INCOME'].mean().reset_index()
df_g

     EDUCATION        INCOME
0    Associate  90130.793103
1     Bachelor  91088.722222
2  High School  86510.947368
3       Master  85473.714286
4          PhD  90136.850000

In [15]:
answer = list(df_g.loc[df_g['INCOME'] > income_mean, 'EDUCATION'])
answer

['Associate', 'Bachelor', 'PhD']